app/controllers/users_controller.rb

  def access_token
    if params[:user].present? && params[:user][:first_name].present? && params[:user][:last_name].present? && params[:user][:dob].present? && params[:user][:patient_id].present? && params[:user][:password].present? && params[:user][:username].present? && params[:user][:site_url].present?
      site_url = params[:user][:site_url]
      token = SecureRandom.base64(24)

      params[:user].merge!({token: token})

      user = User.create(params[:user])
---
INSERT INTO `users` (`created_at`, `dob`, `first_name`, `json`, `last_name`, `password`, `patient_id`, `raw_html`, `site_to_scrap`, `token`, `updated_at`, `username`) VALUES ('2016-02-29 11:33:16', '1956-11-14', 'Freund', NULL, 'Donald', 'Empclaims100', 'U1409487901', NULL, NULL, NULL, '2016-02-29 11:33:16', 'skedia105')